selfservice/src/test/resources/lmng-queries/lmngAllAccountsGeenSurfInstellingen.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:adr="http://www.w3.org/2005/08/addressing"
               xmlns:sur="http://Surfmarket.CRMProxyService">
  <soap:Header>
    <adr:MessageID>urn:uuid:%UID%</adr:MessageID>
    <adr:ReplyTo>
      <adr:Address>http://www.w3.org/2005/08/addressing/anonymous</adr:Address>
    </adr:ReplyTo>
    <adr:To s:mustUnderstand="1" xmlns:s="s">https://crmproxy.surfmarket.nl/crmservice.svc</adr:To>
    <adr:Action>http://Surfmarket.CRMProxyService/ICrmService/GetData</adr:Action>
  </soap:Header>
  <soap:Body>
    <sur:GetData>
      <sur:InputXml>
        <fetch version="1.0" output-format="xml-platform" mapping="logical" distinct="false">
          <entity name="account">
            <attribute name="name"/>
            <attribute name="primarycontactid"/>
            <attribute name="customertypecode"/>
            <attribute name="statuscode"/>
            <attribute name="lmng_schachomeorganization"/>
            <attribute name="accountid"/>
            <order attribute="name" descending="false"/>
            <filter type="and">
              <condition attribute="statecode" operator="eq" value="0"/>
              <condition attribute="surf_isinstelling" operator="eq" value="0"/>
            </filter>
          </entity>
        </fetch>
      </sur:InputXml>
    </sur:GetData>
  </soap:Body>
</soap:Envelope>
